Microchip-MPLAB-Harmony/touch_apps/apps/onboard_sensor/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/tcc.h
#define TCC_STATUS_FAULT_Pos                  _UINT32_(14)                                         /* (TCC_STATUS Position) Non-recoverable Fault x State */
#define TCC_STATUS_FAULT_Msk                  (_UINT32_(0x3) << TCC_STATUS_FAULT_Pos)              /* (TCC_STATUS Mask) FAULT */
#define TCC_STATUS_FAULT(value)               (TCC_STATUS_FAULT_Msk & (_UINT32_(value) << TCC_STATUS_FAULT_Pos)) 
#define TCC_STATUS_CCBUFV_Pos                 _UINT32_(16)                                         /* (TCC_STATUS Position) Compare/Capture Channel x Buffer Valid */
#define TCC_STATUS_CCBUFV_Msk                 (_UINT32_(0xF) << TCC_STATUS_CCBUFV_Pos)             /* (TCC_STATUS Mask) CCBUFV */
#define TCC_STATUS_CCBUFV(value)              (TCC_STATUS_CCBUFV_Msk & (_UINT32_(value) << TCC_STATUS_CCBUFV_Pos)) 
#define TCC_STATUS_CMP_Pos                    _UINT32_(24)                                         /* (TCC_STATUS Position) Compare Channel 3 Value */
#define TCC_STATUS_CMP_Msk                    (_UINT32_(0xF) << TCC_STATUS_CMP_Pos)                /* (TCC_STATUS Mask) CMP */
#define TCC_STATUS_CMP(value)                 (TCC_STATUS_CMP_Msk & (_UINT32_(value) << TCC_STATUS_CMP_Pos)) 

/* -------- TCC_COUNT : (TCC Offset: 0x34) (R/W 32) Counter -------- */
#define TCC_COUNT_RESETVALUE                  _UINT32_(0x00)                                       /*  (TCC_COUNT) Counter  Reset Value */

#define TCC_COUNT_COUNT_Pos                   _UINT32_(0)                                          /* (TCC_COUNT) Counter Value Position */
#define TCC_COUNT_COUNT_Msk                   (_UINT32_(0xFFFF) << TCC_COUNT_COUNT_Pos)            /* (TCC_COUNT) Counter Value Mask */
#define TCC_COUNT_COUNT(value)                (TCC_COUNT_COUNT_Msk & (_UINT32_(value) << TCC_COUNT_COUNT_Pos)) /* Assignment of value for COUNT in the TCC_COUNT register */
#define TCC_COUNT_Msk                         _UINT32_(0x0000FFFF)                                 /* (TCC_COUNT) Register Mask  */


/* -------- TCC_PATT : (TCC Offset: 0x38) (R/W 16) Pattern -------- */
#define TCC_PATT_RESETVALUE                   _UINT16_(0x00)                                       /*  (TCC_PATT) Pattern  Reset Value */

#define TCC_PATT_PGE0_Pos                     _UINT16_(0)                                          /* (TCC_PATT) Pattern Generation Output 0 Enable Position */
#define TCC_PATT_PGE0_Msk                     (_UINT16_(0x1) << TCC_PATT_PGE0_Pos)                 /* (TCC_PATT) Pattern Generation Output 0 Enable Mask */
#define TCC_PATT_PGE0(value)                  (TCC_PATT_PGE0_Msk & (_UINT16_(value) << TCC_PATT_PGE0_Pos)) /* Assignment of value for PGE0 in the TCC_PATT register */
#define TCC_PATT_PGE1_Pos                     _UINT16_(1)                                          /* (TCC_PATT) Pattern Generation Output 1 Enable Position */
#define TCC_PATT_PGE1_Msk                     (_UINT16_(0x1) << TCC_PATT_PGE1_Pos)                 /* (TCC_PATT) Pattern Generation Output 1 Enable Mask */
#define TCC_PATT_PGE1(value)                  (TCC_PATT_PGE1_Msk & (_UINT16_(value) << TCC_PATT_PGE1_Pos)) /* Assignment of value for PGE1 in the TCC_PATT register */
#define TCC_PATT_PGE2_Pos                     _UINT16_(2)                                          /* (TCC_PATT) Pattern Generation Output 2 Enable Position */
#define TCC_PATT_PGE2_Msk                     (_UINT16_(0x1) << TCC_PATT_PGE2_Pos)                 /* (TCC_PATT) Pattern Generation Output 2 Enable Mask */
#define TCC_PATT_PGE2(value)                  (TCC_PATT_PGE2_Msk & (_UINT16_(value) << TCC_PATT_PGE2_Pos)) /* Assignment of value for PGE2 in the TCC_PATT register */
#define TCC_PATT_PGE3_Pos                     _UINT16_(3)                                          /* (TCC_PATT) Pattern Generation Output 3 Enable Position */
#define TCC_PATT_PGE3_Msk                     (_UINT16_(0x1) << TCC_PATT_PGE3_Pos)                 /* (TCC_PATT) Pattern Generation Output 3 Enable Mask */
#define TCC_PATT_PGE3(value)                  (TCC_PATT_PGE3_Msk & (_UINT16_(value) << TCC_PATT_PGE3_Pos)) /* Assignment of value for PGE3 in the TCC_PATT register */
#define TCC_PATT_PGV0_Pos                     _UINT16_(8)                                          /* (TCC_PATT) Pattern Generation Output 0 Value Position */
#define TCC_PATT_PGV0_Msk                     (_UINT16_(0x1) << TCC_PATT_PGV0_Pos)                 /* (TCC_PATT) Pattern Generation Output 0 Value Mask */
#define TCC_PATT_PGV0(value)                  (TCC_PATT_PGV0_Msk & (_UINT16_(value) << TCC_PATT_PGV0_Pos)) /* Assignment of value for PGV0 in the TCC_PATT register */
#define TCC_PATT_PGV1_Pos                     _UINT16_(9)                                          /* (TCC_PATT) Pattern Generation Output 1 Value Position */
#define TCC_PATT_PGV1_Msk                     (_UINT16_(0x1) << TCC_PATT_PGV1_Pos)                 /* (TCC_PATT) Pattern Generation Output 1 Value Mask */
#define TCC_PATT_PGV1(value)                  (TCC_PATT_PGV1_Msk & (_UINT16_(value) << TCC_PATT_PGV1_Pos)) /* Assignment of value for PGV1 in the TCC_PATT register */
#define TCC_PATT_PGV2_Pos                     _UINT16_(10)                                         /* (TCC_PATT) Pattern Generation Output 2 Value Position */
#define TCC_PATT_PGV2_Msk                     (_UINT16_(0x1) << TCC_PATT_PGV2_Pos)                 /* (TCC_PATT) Pattern Generation Output 2 Value Mask */
#define TCC_PATT_PGV2(value)                  (TCC_PATT_PGV2_Msk & (_UINT16_(value) << TCC_PATT_PGV2_Pos)) /* Assignment of value for PGV2 in the TCC_PATT register */
#define TCC_PATT_PGV3_Pos                     _UINT16_(11)                                         /* (TCC_PATT) Pattern Generation Output 3 Value Position */
#define TCC_PATT_PGV3_Msk                     (_UINT16_(0x1) << TCC_PATT_PGV3_Pos)                 /* (TCC_PATT) Pattern Generation Output 3 Value Mask */
#define TCC_PATT_PGV3(value)                  (TCC_PATT_PGV3_Msk & (_UINT16_(value) << TCC_PATT_PGV3_Pos)) /* Assignment of value for PGV3 in the TCC_PATT register */
#define TCC_PATT_Msk                          _UINT16_(0x0F0F)                                     /* (TCC_PATT) Register Mask  */

#define TCC_PATT_PGE_Pos                      _UINT16_(0)                                          /* (TCC_PATT Position) Pattern Generation Output x Enable */
#define TCC_PATT_PGE_Msk                      (_UINT16_(0xF) << TCC_PATT_PGE_Pos)                  /* (TCC_PATT Mask) PGE */
#define TCC_PATT_PGE(value)                   (TCC_PATT_PGE_Msk & (_UINT16_(value) << TCC_PATT_PGE_Pos)) 
#define TCC_PATT_PGV_Pos                      _UINT16_(8)                                          /* (TCC_PATT Position) Pattern Generation Output 3 Value */
#define TCC_PATT_PGV_Msk                      (_UINT16_(0xF) << TCC_PATT_PGV_Pos)                  /* (TCC_PATT Mask) PGV */
#define TCC_PATT_PGV(value)                   (TCC_PATT_PGV_Msk & (_UINT16_(value) << TCC_PATT_PGV_Pos)) 

/* -------- TCC_WAVE : (TCC Offset: 0x3C) (R/W 32) Waveform -------- */
#define TCC_WAVE_RESETVALUE                   _UINT32_(0x00)                                       /*  (TCC_WAVE) Waveform  Reset Value */

#define TCC_WAVE_WAVEGEN_Pos                  _UINT32_(0)                                          /* (TCC_WAVE) Waveform Generation Operation Position */
#define TCC_WAVE_WAVEGEN_Msk                  (_UINT32_(0x7) << TCC_WAVE_WAVEGEN_Pos)              /* (TCC_WAVE) Waveform Generation Operation Mask */
#define TCC_WAVE_WAVEGEN(value)               (TCC_WAVE_WAVEGEN_Msk & (_UINT32_(value) << TCC_WAVE_WAVEGEN_Pos)) /* Assignment of value for WAVEGEN in the TCC_WAVE register */
#define   TCC_WAVE_WAVEGEN_NFRQ_Val           _UINT32_(0x0)                                        /* (TCC_WAVE) Normal Frequency  */
#define   TCC_WAVE_WAVEGEN_MFRQ_Val           _UINT32_(0x1)                                        /* (TCC_WAVE) Match Frequency  */
#define   TCC_WAVE_WAVEGEN_NPWM_Val           _UINT32_(0x2)                                        /* (TCC_WAVE) Normal PWM  */
#define   TCC_WAVE_WAVEGEN_DPWM_Val           _UINT32_(0x3)                                        /* (TCC_WAVE) Dual Compare PWM  */
#define   TCC_WAVE_WAVEGEN_DSCRITICAL_Val     _UINT32_(0x4)                                        /* (TCC_WAVE) Dual-slope PWM  */
#define   TCC_WAVE_WAVEGEN_DSBOTTOM_Val       _UINT32_(0x5)                                        /* (TCC_WAVE) Dual-slope PWM  */
#define   TCC_WAVE_WAVEGEN_DSBOTH_Val         _UINT32_(0x6)                                        /* (TCC_WAVE) Dual-slope PWM  */
#define   TCC_WAVE_WAVEGEN_DSTOP_Val          _UINT32_(0x7)                                        /* (TCC_WAVE) Dual-slope PWM  */
#define TCC_WAVE_WAVEGEN_NFRQ                 (TCC_WAVE_WAVEGEN_NFRQ_Val << TCC_WAVE_WAVEGEN_Pos)  /* (TCC_WAVE) Normal Frequency Position */
#define TCC_WAVE_WAVEGEN_MFRQ                 (TCC_WAVE_WAVEGEN_MFRQ_Val << TCC_WAVE_WAVEGEN_Pos)  /* (TCC_WAVE) Match Frequency Position */
#define TCC_WAVE_WAVEGEN_NPWM                 (TCC_WAVE_WAVEGEN_NPWM_Val << TCC_WAVE_WAVEGEN_Pos)  /* (TCC_WAVE) Normal PWM Position */
#define TCC_WAVE_WAVEGEN_DPWM                 (TCC_WAVE_WAVEGEN_DPWM_Val << TCC_WAVE_WAVEGEN_Pos)  /* (TCC_WAVE) Dual Compare PWM Position */
#define TCC_WAVE_WAVEGEN_DSCRITICAL           (TCC_WAVE_WAVEGEN_DSCRITICAL_Val << TCC_WAVE_WAVEGEN_Pos) /* (TCC_WAVE) Dual-slope PWM Position */
#define TCC_WAVE_WAVEGEN_DSBOTTOM             (TCC_WAVE_WAVEGEN_DSBOTTOM_Val << TCC_WAVE_WAVEGEN_Pos) /* (TCC_WAVE) Dual-slope PWM Position */
#define TCC_WAVE_WAVEGEN_DSBOTH               (TCC_WAVE_WAVEGEN_DSBOTH_Val << TCC_WAVE_WAVEGEN_Pos) /* (TCC_WAVE) Dual-slope PWM Position */
#define TCC_WAVE_WAVEGEN_DSTOP                (TCC_WAVE_WAVEGEN_DSTOP_Val << TCC_WAVE_WAVEGEN_Pos) /* (TCC_WAVE) Dual-slope PWM Position */
#define TCC_WAVE_RAMP_Pos                     _UINT32_(4)                                          /* (TCC_WAVE) Ramp Operation Position */
#define TCC_WAVE_RAMP_Msk                     (_UINT32_(0x7) << TCC_WAVE_RAMP_Pos)                 /* (TCC_WAVE) Ramp Operation Mask */
#define TCC_WAVE_RAMP(value)                  (TCC_WAVE_RAMP_Msk & (_UINT32_(value) << TCC_WAVE_RAMP_Pos)) /* Assignment of value for RAMP in the TCC_WAVE register */
#define   TCC_WAVE_RAMP_RAMP1_Val             _UINT32_(0x0)                                        /* (TCC_WAVE) RAMP1 operation  */
#define   TCC_WAVE_RAMP_RAMP2A_Val            _UINT32_(0x1)                                        /* (TCC_WAVE) Alternative RAMP2 operation  */
#define   TCC_WAVE_RAMP_RAMP2_Val             _UINT32_(0x2)                                        /* (TCC_WAVE) RAMP2 operation  */
#define   TCC_WAVE_RAMP_RAMP2C_Val            _UINT32_(0x3)                                        /* (TCC_WAVE) Critical RAMP2 operation  */
#define TCC_WAVE_RAMP_RAMP1                   (TCC_WAVE_RAMP_RAMP1_Val << TCC_WAVE_RAMP_Pos)       /* (TCC_WAVE) RAMP1 operation Position */
#define TCC_WAVE_RAMP_RAMP2A                  (TCC_WAVE_RAMP_RAMP2A_Val << TCC_WAVE_RAMP_Pos)      /* (TCC_WAVE) Alternative RAMP2 operation Position */
#define TCC_WAVE_RAMP_RAMP2                   (TCC_WAVE_RAMP_RAMP2_Val << TCC_WAVE_RAMP_Pos)       /* (TCC_WAVE) RAMP2 operation Position */
#define TCC_WAVE_RAMP_RAMP2C                  (TCC_WAVE_RAMP_RAMP2C_Val << TCC_WAVE_RAMP_Pos)      /* (TCC_WAVE) Critical RAMP2 operation Position */
#define TCC_WAVE_CIPEREN_Pos                  _UINT32_(7)                                          /* (TCC_WAVE) Circular Period Enable Position */
#define TCC_WAVE_CIPEREN_Msk                  (_UINT32_(0x1) << TCC_WAVE_CIPEREN_Pos)              /* (TCC_WAVE) Circular Period Enable Mask */
#define TCC_WAVE_CIPEREN(value)               (TCC_WAVE_CIPEREN_Msk & (_UINT32_(value) << TCC_WAVE_CIPEREN_Pos)) /* Assignment of value for CIPEREN in the TCC_WAVE register */
#define TCC_WAVE_CICCEN0_Pos                  _UINT32_(8)                                          /* (TCC_WAVE) Circular Compare/Capture Channel 0 Enable Position */
#define TCC_WAVE_CICCEN0_Msk                  (_UINT32_(0x1) << TCC_WAVE_CICCEN0_Pos)              /* (TCC_WAVE) Circular Compare/Capture Channel 0 Enable Mask */
#define TCC_WAVE_CICCEN0(value)               (TCC_WAVE_CICCEN0_Msk & (_UINT32_(value) << TCC_WAVE_CICCEN0_Pos)) /* Assignment of value for CICCEN0 in the TCC_WAVE register */
#define TCC_WAVE_CICCEN1_Pos                  _UINT32_(9)                                          /* (TCC_WAVE) Circular Compare/Capture Channel 1 Enable Position */
#define TCC_WAVE_CICCEN1_Msk                  (_UINT32_(0x1) << TCC_WAVE_CICCEN1_Pos)              /* (TCC_WAVE) Circular Compare/Capture Channel 1 Enable Mask */
#define TCC_WAVE_CICCEN1(value)               (TCC_WAVE_CICCEN1_Msk & (_UINT32_(value) << TCC_WAVE_CICCEN1_Pos)) /* Assignment of value for CICCEN1 in the TCC_WAVE register */
#define TCC_WAVE_CICCEN2_Pos                  _UINT32_(10)                                         /* (TCC_WAVE) Circular Compare/Capture Channel 2 Enable Position */
#define TCC_WAVE_CICCEN2_Msk                  (_UINT32_(0x1) << TCC_WAVE_CICCEN2_Pos)              /* (TCC_WAVE) Circular Compare/Capture Channel 2 Enable Mask */
#define TCC_WAVE_CICCEN2(value)               (TCC_WAVE_CICCEN2_Msk & (_UINT32_(value) << TCC_WAVE_CICCEN2_Pos)) /* Assignment of value for CICCEN2 in the TCC_WAVE register */
#define TCC_WAVE_CICCEN3_Pos                  _UINT32_(11)                                         /* (TCC_WAVE) Circular Compare/Capture Channel 3 Enable Position */
#define TCC_WAVE_CICCEN3_Msk                  (_UINT32_(0x1) << TCC_WAVE_CICCEN3_Pos)              /* (TCC_WAVE) Circular Compare/Capture Channel 3 Enable Mask */
#define TCC_WAVE_CICCEN3(value)               (TCC_WAVE_CICCEN3_Msk & (_UINT32_(value) << TCC_WAVE_CICCEN3_Pos)) /* Assignment of value for CICCEN3 in the TCC_WAVE register */
#define TCC_WAVE_Msk                          _UINT32_(0x00000FF7)                                 /* (TCC_WAVE) Register Mask  */

/* DUALCOMPARE mode */
#define TCC_WAVE_DUALCOMPARE_POL0_Pos         _UINT32_(16)                                         /* (TCC_WAVE) Channel 0 Polarity Position */
#define TCC_WAVE_DUALCOMPARE_POL0_Msk         (_UINT32_(0x1) << TCC_WAVE_DUALCOMPARE_POL0_Pos)     /* (TCC_WAVE) Channel 0 Polarity Mask */
#define TCC_WAVE_DUALCOMPARE_POL0(value)      (TCC_WAVE_DUALCOMPARE_POL0_Msk & (_UINT32_(value) << TCC_WAVE_DUALCOMPARE_POL0_Pos))
#define   TCC_WAVE_DUALCOMPARE_POL0_NORMAL_Val _UINT32_(0x0)                                        /* (TCC_WAVE) Compare output is initialized to ~DIR, set to DIR when TCC counter matches CCn value and set to ~DIR when TCC counter matches CC[n+WO_NUM/2] value.  */
#define   TCC_WAVE_DUALCOMPARE_POL0_INVERTED_Val _UINT32_(0x1)                                        /* (TCC_WAVE) Compare output is initialized to DIR, set to ~DIR when TCC counter matches CCn value and set to DIR when TCC counter matches CC[n+WO_NUM/2] value.  */
#define TCC_WAVE_DUALCOMPARE_POL0_NORMAL      (TCC_WAVE_DUALCOMPARE_POL0_NORMAL_Val << TCC_WAVE_DUALCOMPARE_POL0_Pos) /* (TCC_WAVE) Compare output is initialized to ~DIR, set to DIR when TCC counter matches CCn value and set to ~DIR when TCC counter matches CC[n+WO_NUM/2] value. Position */
#define TCC_WAVE_DUALCOMPARE_POL0_INVERTED    (TCC_WAVE_DUALCOMPARE_POL0_INVERTED_Val << TCC_WAVE_DUALCOMPARE_POL0_Pos) /* (TCC_WAVE) Compare output is initialized to DIR, set to ~DIR when TCC counter matches CCn value and set to DIR when TCC counter matches CC[n+WO_NUM/2] value. Position */
#define TCC_WAVE_DUALCOMPARE_POL1_Pos         _UINT32_(17)                                         /* (TCC_WAVE) Channel 1 Polarity Position */
#define TCC_WAVE_DUALCOMPARE_POL1_Msk         (_UINT32_(0x1) << TCC_WAVE_DUALCOMPARE_POL1_Pos)     /* (TCC_WAVE) Channel 1 Polarity Mask */
#define TCC_WAVE_DUALCOMPARE_POL1(value)      (TCC_WAVE_DUALCOMPARE_POL1_Msk & (_UINT32_(value) << TCC_WAVE_DUALCOMPARE_POL1_Pos))
#define   TCC_WAVE_DUALCOMPARE_POL1_NORMAL_Val _UINT32_(0x0)                                        /* (TCC_WAVE) Compare output is initialized to ~DIR, set to DIR when TCC counter matches CCn value and set to ~DIR when TCC counter matches CC[n+WO_NUM/2] value.  */
#define   TCC_WAVE_DUALCOMPARE_POL1_INVERTED_Val _UINT32_(0x1)                                        /* (TCC_WAVE) Compare output is initialized to DIR, set to ~DIR when TCC counter matches CCn value and set to DIR when TCC counter matches CC[n+WO_NUM/2] value.  */
#define TCC_WAVE_DUALCOMPARE_POL1_NORMAL      (TCC_WAVE_DUALCOMPARE_POL1_NORMAL_Val << TCC_WAVE_DUALCOMPARE_POL1_Pos) /* (TCC_WAVE) Compare output is initialized to ~DIR, set to DIR when TCC counter matches CCn value and set to ~DIR when TCC counter matches CC[n+WO_NUM/2] value. Position */
#define TCC_WAVE_DUALCOMPARE_POL1_INVERTED    (TCC_WAVE_DUALCOMPARE_POL1_INVERTED_Val << TCC_WAVE_DUALCOMPARE_POL1_Pos) /* (TCC_WAVE) Compare output is initialized to DIR, set to ~DIR when TCC counter matches CCn value and set to DIR when TCC counter matches CC[n+WO_NUM/2] value. Position */
#define TCC_WAVE_DUALCOMPARE_POL2_Pos         _UINT32_(18)                                         /* (TCC_WAVE) Channel 2 Polarity Position */
#define TCC_WAVE_DUALCOMPARE_POL2_Msk         (_UINT32_(0x1) << TCC_WAVE_DUALCOMPARE_POL2_Pos)     /* (TCC_WAVE) Channel 2 Polarity Mask */
#define TCC_WAVE_DUALCOMPARE_POL2(value)      (TCC_WAVE_DUALCOMPARE_POL2_Msk & (_UINT32_(value) << TCC_WAVE_DUALCOMPARE_POL2_Pos))
#define   TCC_WAVE_DUALCOMPARE_POL2_NORMAL_Val _UINT32_(0x0)                                        /* (TCC_WAVE) Compare output is initialized to ~DIR, set to DIR when TCC counter matches CCn value and set to ~DIR when TCC counter matches CC[n+WO_NUM/2] value.  */
#define   TCC_WAVE_DUALCOMPARE_POL2_INVERTED_Val _UINT32_(0x1)                                        /* (TCC_WAVE) Compare output is initialized to DIR, set to ~DIR when TCC counter matches CCn value and set to DIR when TCC counter matches CC[n+WO_NUM/2] value.  */
#define TCC_WAVE_DUALCOMPARE_POL2_NORMAL      (TCC_WAVE_DUALCOMPARE_POL2_NORMAL_Val << TCC_WAVE_DUALCOMPARE_POL2_Pos) /* (TCC_WAVE) Compare output is initialized to ~DIR, set to DIR when TCC counter matches CCn value and set to ~DIR when TCC counter matches CC[n+WO_NUM/2] value. Position */
#define TCC_WAVE_DUALCOMPARE_POL2_INVERTED    (TCC_WAVE_DUALCOMPARE_POL2_INVERTED_Val << TCC_WAVE_DUALCOMPARE_POL2_Pos) /* (TCC_WAVE) Compare output is initialized to DIR, set to ~DIR when TCC counter matches CCn value and set to DIR when TCC counter matches CC[n+WO_NUM/2] value. Position */
#define TCC_WAVE_DUALCOMPARE_POL3_Pos         _UINT32_(19)                                         /* (TCC_WAVE) Channel 3 Polarity Position */
#define TCC_WAVE_DUALCOMPARE_POL3_Msk         (_UINT32_(0x1) << TCC_WAVE_DUALCOMPARE_POL3_Pos)     /* (TCC_WAVE) Channel 3 Polarity Mask */
#define TCC_WAVE_DUALCOMPARE_POL3(value)      (TCC_WAVE_DUALCOMPARE_POL3_Msk & (_UINT32_(value) << TCC_WAVE_DUALCOMPARE_POL3_Pos))
#define   TCC_WAVE_DUALCOMPARE_POL3_NORMAL_Val _UINT32_(0x0)                                        /* (TCC_WAVE) Compare output is initialized to ~DIR, set to DIR when TCC counter matches CCn value and set to ~DIR when TCC counter matches CC[n+WO_NUM/2] value.  */
#define   TCC_WAVE_DUALCOMPARE_POL3_INVERTED_Val _UINT32_(0x1)                                        /* (TCC_WAVE) Compare output is initialized to DIR, set to ~DIR when TCC counter matches CCn value and set to DIR when TCC counter matches CC[n+WO_NUM/2] value.  */
#define TCC_WAVE_DUALCOMPARE_POL3_NORMAL      (TCC_WAVE_DUALCOMPARE_POL3_NORMAL_Val << TCC_WAVE_DUALCOMPARE_POL3_Pos) /* (TCC_WAVE) Compare output is initialized to ~DIR, set to DIR when TCC counter matches CCn value and set to ~DIR when TCC counter matches CC[n+WO_NUM/2] value. Position */
#define TCC_WAVE_DUALCOMPARE_POL3_INVERTED    (TCC_WAVE_DUALCOMPARE_POL3_INVERTED_Val << TCC_WAVE_DUALCOMPARE_POL3_Pos) /* (TCC_WAVE) Compare output is initialized to DIR, set to ~DIR when TCC counter matches CCn value and set to DIR when TCC counter matches CC[n+WO_NUM/2] value. Position */
#define TCC_WAVE_DUALCOMPARE_Msk              _UINT32_(0x000F0000)                                 /* (TCC_WAVE_DUALCOMPARE) Register Mask  */

