Microchip-MPLAB-Harmony/touch_apps/apps/onboard_sensor/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/tcc.h
#define TCC_PATTBUF_PGEB0_Pos                 _UINT16_(0)                                          /* (TCC_PATTBUF) Pattern Generation Output Enable Buffer 0 Position */
#define TCC_PATTBUF_PGEB0_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGEB0_Pos)             /* (TCC_PATTBUF) Pattern Generation Output Enable Buffer 0 Mask */
#define TCC_PATTBUF_PGEB0(value)              (TCC_PATTBUF_PGEB0_Msk & (_UINT16_(value) << TCC_PATTBUF_PGEB0_Pos)) /* Assignment of value for PGEB0 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGEB1_Pos                 _UINT16_(1)                                          /* (TCC_PATTBUF) Pattern Generation Output Enable Buffer 1 Position */
#define TCC_PATTBUF_PGEB1_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGEB1_Pos)             /* (TCC_PATTBUF) Pattern Generation Output Enable Buffer 1 Mask */
#define TCC_PATTBUF_PGEB1(value)              (TCC_PATTBUF_PGEB1_Msk & (_UINT16_(value) << TCC_PATTBUF_PGEB1_Pos)) /* Assignment of value for PGEB1 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGEB2_Pos                 _UINT16_(2)                                          /* (TCC_PATTBUF) Pattern Generation Output Enable Buffer 2 Position */
#define TCC_PATTBUF_PGEB2_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGEB2_Pos)             /* (TCC_PATTBUF) Pattern Generation Output Enable Buffer 2 Mask */
#define TCC_PATTBUF_PGEB2(value)              (TCC_PATTBUF_PGEB2_Msk & (_UINT16_(value) << TCC_PATTBUF_PGEB2_Pos)) /* Assignment of value for PGEB2 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGEB3_Pos                 _UINT16_(3)                                          /* (TCC_PATTBUF) Pattern Generation Output Enable Buffer 3 Position */
#define TCC_PATTBUF_PGEB3_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGEB3_Pos)             /* (TCC_PATTBUF) Pattern Generation Output Enable Buffer 3 Mask */
#define TCC_PATTBUF_PGEB3(value)              (TCC_PATTBUF_PGEB3_Msk & (_UINT16_(value) << TCC_PATTBUF_PGEB3_Pos)) /* Assignment of value for PGEB3 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGVB0_Pos                 _UINT16_(8)                                          /* (TCC_PATTBUF) Pattern Generation Output Value Buffer 0 Position */
#define TCC_PATTBUF_PGVB0_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGVB0_Pos)             /* (TCC_PATTBUF) Pattern Generation Output Value Buffer 0 Mask */
#define TCC_PATTBUF_PGVB0(value)              (TCC_PATTBUF_PGVB0_Msk & (_UINT16_(value) << TCC_PATTBUF_PGVB0_Pos)) /* Assignment of value for PGVB0 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGVB1_Pos                 _UINT16_(9)                                          /* (TCC_PATTBUF) Pattern Generation Output Value Buffer 1 Position */
#define TCC_PATTBUF_PGVB1_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGVB1_Pos)             /* (TCC_PATTBUF) Pattern Generation Output Value Buffer 1 Mask */
#define TCC_PATTBUF_PGVB1(value)              (TCC_PATTBUF_PGVB1_Msk & (_UINT16_(value) << TCC_PATTBUF_PGVB1_Pos)) /* Assignment of value for PGVB1 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGVB2_Pos                 _UINT16_(10)                                         /* (TCC_PATTBUF) Pattern Generation Output Value Buffer 2 Position */
#define TCC_PATTBUF_PGVB2_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGVB2_Pos)             /* (TCC_PATTBUF) Pattern Generation Output Value Buffer 2 Mask */
#define TCC_PATTBUF_PGVB2(value)              (TCC_PATTBUF_PGVB2_Msk & (_UINT16_(value) << TCC_PATTBUF_PGVB2_Pos)) /* Assignment of value for PGVB2 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGVB3_Pos                 _UINT16_(11)                                         /* (TCC_PATTBUF) Pattern Generation Output Value Buffer 3 Position */
#define TCC_PATTBUF_PGVB3_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGVB3_Pos)             /* (TCC_PATTBUF) Pattern Generation Output Value Buffer 3 Mask */
#define TCC_PATTBUF_PGVB3(value)              (TCC_PATTBUF_PGVB3_Msk & (_UINT16_(value) << TCC_PATTBUF_PGVB3_Pos)) /* Assignment of value for PGVB3 in the TCC_PATTBUF register */
#define TCC_PATTBUF_Msk                       _UINT16_(0x0F0F)                                     /* (TCC_PATTBUF) Register Mask  */

#define TCC_PATTBUF_PGEB_Pos                  _UINT16_(0)                                          /* (TCC_PATTBUF Position) Pattern Generation Output Enable Buffer x */
#define TCC_PATTBUF_PGEB_Msk                  (_UINT16_(0xF) << TCC_PATTBUF_PGEB_Pos)              /* (TCC_PATTBUF Mask) PGEB */
#define TCC_PATTBUF_PGEB(value)               (TCC_PATTBUF_PGEB_Msk & (_UINT16_(value) << TCC_PATTBUF_PGEB_Pos)) 
#define TCC_PATTBUF_PGVB_Pos                  _UINT16_(8)                                          /* (TCC_PATTBUF Position) Pattern Generation Output Value Buffer 3 */
#define TCC_PATTBUF_PGVB_Msk                  (_UINT16_(0xF) << TCC_PATTBUF_PGVB_Pos)              /* (TCC_PATTBUF Mask) PGVB */
#define TCC_PATTBUF_PGVB(value)               (TCC_PATTBUF_PGVB_Msk & (_UINT16_(value) << TCC_PATTBUF_PGVB_Pos)) 

/* -------- TCC_PERBUF : (TCC Offset: 0x6C) (R/W 32) Period Buffer -------- */
#define TCC_PERBUF_RESETVALUE                 _UINT32_(0xFFFFFFFF)                                 /*  (TCC_PERBUF) Period Buffer  Reset Value */

#define TCC_PERBUF_PERBUF_Pos                 _UINT32_(0)                                          /* (TCC_PERBUF) Period Buffer Value Position */
#define TCC_PERBUF_PERBUF_Msk                 (_UINT32_(0xFFFF) << TCC_PERBUF_PERBUF_Pos)          /* (TCC_PERBUF) Period Buffer Value Mask */
#define TCC_PERBUF_PERBUF(value)              (TCC_PERBUF_PERBUF_Msk & (_UINT32_(value) << TCC_PERBUF_PERBUF_Pos)) /* Assignment of value for PERBUF in the TCC_PERBUF register */
#define TCC_PERBUF_Msk                        _UINT32_(0x0000FFFF)                                 /* (TCC_PERBUF) Register Mask  */


/* -------- TCC_CCBUF : (TCC Offset: 0x70) (R/W 32) Compare/Capture Channel # Buffer -------- */
#define TCC_CCBUF_RESETVALUE                  _UINT32_(0x00)                                       /*  (TCC_CCBUF) Compare/Capture Channel # Buffer  Reset Value */

#define TCC_CCBUF_CCBUF_Pos                   _UINT32_(0)                                          /* (TCC_CCBUF) Compare/Capture Channel Buffer Value Position */
#define TCC_CCBUF_CCBUF_Msk                   (_UINT32_(0xFFFF) << TCC_CCBUF_CCBUF_Pos)            /* (TCC_CCBUF) Compare/Capture Channel Buffer Value Mask */
#define TCC_CCBUF_CCBUF(value)                (TCC_CCBUF_CCBUF_Msk & (_UINT32_(value) << TCC_CCBUF_CCBUF_Pos)) /* Assignment of value for CCBUF in the TCC_CCBUF register */
#define TCC_CCBUF_Msk                         _UINT32_(0x0000FFFF)                                 /* (TCC_CCBUF) Register Mask  */


/* TCC register offsets definitions */
#define TCC_CTRLA_REG_OFST             _UINT32_(0x00)      /* (TCC_CTRLA) Control A Offset */
#define TCC_CTRLBCLR_REG_OFST          _UINT32_(0x04)      /* (TCC_CTRLBCLR) Control B Clear Offset */
#define TCC_CTRLBSET_REG_OFST          _UINT32_(0x05)      /* (TCC_CTRLBSET) Control B Set Offset */
#define TCC_SYNCBUSY_REG_OFST          _UINT32_(0x08)      /* (TCC_SYNCBUSY) Synchronization Busy Offset */
#define TCC_FCTRLA_REG_OFST            _UINT32_(0x0C)      /* (TCC_FCTRLA) Recoverable Fault Control # Offset */
#define TCC_FCTRLB_REG_OFST            _UINT32_(0x10)      /* (TCC_FCTRLB) Recoverable Fault Control # Offset */
#define TCC_WEXCTRL_REG_OFST           _UINT32_(0x14)      /* (TCC_WEXCTRL) Waveform Extension Control Offset */
#define TCC_DRVCTRL_REG_OFST           _UINT32_(0x18)      /* (TCC_DRVCTRL) Driver Control Offset */
#define TCC_DBGCTRL_REG_OFST           _UINT32_(0x1E)      /* (TCC_DBGCTRL) Debug control Offset */
#define TCC_EVCTRL_REG_OFST            _UINT32_(0x20)      /* (TCC_EVCTRL) Event Control Offset */
#define TCC_INTENCLR_REG_OFST          _UINT32_(0x24)      /* (TCC_INTENCLR) Interrupt Enable Clear Offset */
#define TCC_INTENSET_REG_OFST          _UINT32_(0x28)      /* (TCC_INTENSET) Interrupt Enable Set Offset */
#define TCC_INTFLAG_REG_OFST           _UINT32_(0x2C)      /* (TCC_INTFLAG) Interrupt Flag Status and Clear Offset */
#define TCC_STATUS_REG_OFST            _UINT32_(0x30)      /* (TCC_STATUS) Status Offset */
#define TCC_COUNT_REG_OFST             _UINT32_(0x34)      /* (TCC_COUNT) Counter Offset */
#define TCC_PATT_REG_OFST              _UINT32_(0x38)      /* (TCC_PATT) Pattern Offset */
#define TCC_WAVE_REG_OFST              _UINT32_(0x3C)      /* (TCC_WAVE) Waveform Offset */
#define TCC_PER_REG_OFST               _UINT32_(0x40)      /* (TCC_PER) Period Offset */
#define TCC_CC_REG_OFST                _UINT32_(0x44)      /* (TCC_CC) Compare/Capture Channel # Offset */
#define TCC_CC0_REG_OFST               _UINT32_(0x44)      /* (TCC_CC0) Compare/Capture Channel # Offset */
#define TCC_CC1_REG_OFST               _UINT32_(0x48)      /* (TCC_CC1) Compare/Capture Channel # Offset */
#define TCC_CC2_REG_OFST               _UINT32_(0x4C)      /* (TCC_CC2) Compare/Capture Channel # Offset */
#define TCC_CC3_REG_OFST               _UINT32_(0x50)      /* (TCC_CC3) Compare/Capture Channel # Offset */
#define TCC_PATTBUF_REG_OFST           _UINT32_(0x64)      /* (TCC_PATTBUF) Pattern Buffer Offset */
#define TCC_PERBUF_REG_OFST            _UINT32_(0x6C)      /* (TCC_PERBUF) Period Buffer Offset */
#define TCC_CCBUF_REG_OFST             _UINT32_(0x70)      /* (TCC_CCBUF) Compare/Capture Channel # Buffer Offset */
#define TCC_CCBUF0_REG_OFST            _UINT32_(0x70)      /* (TCC_CCBUF0) Compare/Capture Channel # Buffer Offset */
#define TCC_CCBUF1_REG_OFST            _UINT32_(0x74)      /* (TCC_CCBUF1) Compare/Capture Channel # Buffer Offset */
#define TCC_CCBUF2_REG_OFST            _UINT32_(0x78)      /* (TCC_CCBUF2) Compare/Capture Channel # Buffer Offset */
#define TCC_CCBUF3_REG_OFST            _UINT32_(0x7C)      /* (TCC_CCBUF3) Compare/Capture Channel # Buffer Offset */

